set_device -family {IGLOO2} -die {M2GL025}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_ahbtoapbsm.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_apbaddrdata.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3_penablescheduler.v}
read_verilog -mode system_verilog -lib COREAHBTOAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREAHBTOAPB3\3.1.100\rtl\vlog\core\coreahbtoapb3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\COREAHBTOAPB3_0\COREAHBTOAPB3_0.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_slavearbiter.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_slavestage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_defaultslavesm.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_addrdec.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_masterstage.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAHBLite\5.4.102\rtl\vlog\core\coreahblite_matrix4x16.v}
read_verilog -mode system_verilog -lib COREAHBLITE_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreAHBL_0\CoreAHBL_0_0\rtl\vlog\core\coreahblite.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreAHBL_0\CoreAHBL_0.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_muxptob3.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3_iaddr_reg.v}
read_verilog -mode system_verilog -lib COREAPB3_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreAPB3\4.1.100\rtl\vlog\core\coreapb3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreAPB3_0\CoreAPB3_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreGPIO_IN\CoreGPIO_IN_0\rtl\vlog\core\coregpio.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreGPIO_IN\CoreGPIO_IN.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreGPIO_OUT\CoreGPIO_OUT_0\rtl\vlog\core\coregpio.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreGPIO_OUT\CoreGPIO_OUT.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_ujtag_wrapper.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_bufd.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug_uj_jtag.v}
read_verilog -mode system_verilog -lib COREJTAGDEBUG_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\COREJTAGDEBUG\3.1.100\core\corejtagdebug.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreJTAGDebug_0\CoreJTAGDebug_0.v}
read_verilog -mode system_verilog -lib CORETIMER_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\Actel\DirectCore\CoreTimer\2.0.103\rtl\vlog\core\coretimer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreTimer_0\CoreTimer_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreTimer_1\CoreTimer_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\Clock_gen.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\Rx_async.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\Tx_async.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\fifo_256x8_g4.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\CoreUART.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0_0\rtl\vlog\core_obfuscated\CoreUARTapb.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\CoreUARTapb_0\CoreUARTapb_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\FCCC_0\FCCC_0_0\FCCC_0_FCCC_0_0_FCCC.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\FCCC_0\FCCC_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_coreplex_local_interrupter_clint.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_capture_chain.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_capture_update_chain_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_capture_update_chain.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_jtag_bypass_chain.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_capture_update_chain_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_reg.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_reg_vec_w4_i15.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_jtag_state_machine.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_negative_edge_latch_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_negative_edge_latch.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_jtag_tap_controller.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_debug_transport_module_jtag.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_reg_vec_w1_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_reg_vec_w2_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_sync_crossing_source_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_xbar.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_synchronizer_shift_reg_w31_d3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_xing.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlwidth_widget.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlxbar_memory_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_memory_bus_mem_buses_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlatomic_automata_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlbuffer_periphery_bus_slave_tlbuffer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlbuffer_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_repeater_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_repeater.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlfragmenter_periphery_bus_slave_tlfragmenter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlxbar_periphery_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_periphery_bus_pbus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_synchronizer_shift_reg_w1_d3_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_reset_catch_and_sync_d3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_amoalu.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_arbiter_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_arbiter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_data_arrays_0_ext.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_data_arrays_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_dcache_data_array.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tag_array_ext.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tag_array.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlb.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_dcache_dcache.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_data_arrays_0_0_ext.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_data_arrays_0_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tag_array_0_ext.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tag_array_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_icache_icache.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_shift_queue.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlb_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_frontend_frontend.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_hella_cache_arbiter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_sync_crossing_sink_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_synchronizer_shift_reg_w1_d3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_sync_crossing_sink.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_xbar_int_xbar.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_alu.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_breakpoint_unit.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_csrfile.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_rvcexpander.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_ibuf.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_mul_div.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_plusarg_reader.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_rocket.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_11.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_13.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_14.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_15.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_6.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlbuffer_system_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlxbar_tl_master_xbar.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_rocket_tile.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlcache_cork_system_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlfifofixer_system_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_simple_lazy_module_system_bus_from_tile.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_4.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_5.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlbuffer_system_bus_slave_tlbuffer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlfifofixer_system_bus_pbus_tlfifofixer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlsplitter_system_bus_master_tlsplitter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlwidth_widget_system_bus_slave_tlwidth_widget.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_identity_module.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlxbar_system_bus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_system_bus_sbus.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_synchronizer_shift_reg_w1_d4_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync_3.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_synchronizer_shift_reg_w1_d1_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync_4.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync_5.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_synchronizer_shift_reg_w12_d1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_sink_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_synchronizer_shift_reg_w54_d1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_sink_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_valid_sync.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_source_2.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlasync_crossing_sink_dmi_xing.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tldebug_module_inner_dm_inner.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tldebug_module_inner_async_dm_inner.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_source_1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_dmito_tl_dmi2tl.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_int_sync_crossing_source.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_synchronizer_shift_reg_w42_d1.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_sink.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_queue_source.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlasync_crossing_source_dm_inner.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_async_reset_reg_vec_w32_i0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tldebug_module_outer_dm_outer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlxbar_dmi_xbar.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tldebug_module_outer_async_dm_outer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tldebug_module_debug.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_18.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_19.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlerror_error.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlfilter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_level_gateway.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_10.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlplic_plic.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_queue_16.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlto_ahb_converter.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_tlto_ahb.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb_rocket_system.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0_0\core\miv_rv32ima_l1_ahb.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\MiV_RV32IMA_L1_AHB_0\MiV_RV32IMA_L1_AHB_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\OSC_0\OSC_0_0\OSC_0_OSC_0_0_OSC.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\OSC_0\OSC_0.v}
read_verilog -mode system_verilog -lib COREAHBLSRAM_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0_0\rtl\vlog\core\AHBLSramIf.v}
read_verilog -mode system_verilog -lib COREAHBLSRAM_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0_0\rtl\vlog\core\lsram_2048to139264x8.v}
read_verilog -mode system_verilog -lib COREAHBLSRAM_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0_0\rtl\vlog\core\usram_128to9216x8.v}
read_verilog -mode system_verilog -lib COREAHBLSRAM_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0_0\rtl\vlog\core\SramCtrlIf.v}
read_verilog -mode system_verilog -lib COREAHBLSRAM_LIB {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0_0\rtl\vlog\core\CoreAHBLSRAM.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\SRAM_0\SRAM_0.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\hdl\reset_synchronizer.v}
read_verilog -mode system_verilog {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\BaseDesign\BaseDesign.v}
set_top_level {BaseDesign}
read_sdc -component {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\FCCC_0\FCCC_0_0\FCCC_0_FCCC_0_0_FCCC.sdc}
read_sdc -component {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\component\work\OSC_0\OSC_0_0\OSC_0_OSC_0_0_OSC.sdc}
derive_constraints
write_sdc {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\constraint\BaseDesign_derived_constraints.sdc}
write_pdc {C:\GitHub-LSRAM-12.3\RISC-V-Creative-Board-1\Libero_Projects\MiV_AHB_IG2_Creative\constraint\fp\BaseDesign_derived_constraints.pdc}
